<template>
  <div :class="$style.reviews">
    <BetweenBlocks info="Отзывы" id="reviews" />
    <div v-for="review in reviews" :key="review.number" :class="$style.review">
      <div :class="$style.reviewBlock">
        <img
          :src="require(`../../assets/reviewsPhotos/${review.number}.jpg`)"
          :class="$style.reviewPhoto"
        />
        <div :class="$style.reviewTitle">{{ review.title }}</div>
      </div>
      <div :class="$style.reviewText">{{ review.text }}</div>
    </div>
  </div>
</template>
<script>
import BetweenBlocks from "../BetweenBlocks";
export default {
  components: {
    BetweenBlocks
  },
  data() {
    return {
      selected: 1,
      reviews: [
        {
          number: 1,
          text:
            "Никита — лучшее, что могло случиться с нами по части видеосъемки самого запоминающегося дня нашей жизни. Невероятно тактичный, талантливый, творческий человек, знающий свое дело. Никита подготовил все и уже спустя всего лишь месяц мы могли любоваться нашим свадебным днём и на действительно высшем уровне! Мы сразу же показали клип всем родственникам и друзьям, и никто не остался равнодушен. Многие оценили удачные ракурсы, необычные переходы, музыкальное сопровождение, ну а мы с мужем просто любим теперь пересматривать клип и радоваться, что все прошло так замечательно.",
          title: "Николай и Анастасия"
        },
        {
          number: 2,
          text: `Огромное спасибо Никите за проделанную работу! Для нас Никита сделал двухчасовой фильм всего нашего дня, идеально включил в него все, что мы обговаривали и учел все наши пожелания и предпочтения! Кроме того, поражает качество видео — так все четко, красочно, хороший звук. Смотрели все вместе на одном дыхании, вновь и плакали, и смеялись, да и просто наслаждались просмотром. Также добавлю, что нам не пришлось долго ждать видео, Никита передал его нам в те сроки, как и обещал.То, как Никита оформил этот заказ — просто нет слов! Очень приятно и сразу видно, что человек относится к своему делу серьезно и со всей отдачей!`,
          title: "Андрей и Юлия"
        },
        {
          number: 3,
          text:
            "Большое спасибо Никите за проделанную работу. Ни минуту не сомневались, что наше свадебное видео получится просто волшебным. Очень оперативно, красиво и профессионально",
          title: "Кирилл и Мария"
        }
      ]
    };
  }
};
</script>

<style lang="scss" module>
@import "./styles.scss";
</style>
